Repository: zurce/JASM
Catalog: src/GIMI-ModManager.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: es, ja, pt_br, ru_ru, zh_cn

# EditCharacterPage_InternalNameHelp.Text
source: The Internal Name is used by JASM to identify characters/ModObjects. It is also used as the name of mod folder. Must be unique. Changing this after character has been created means JASM will identify this as a new character.
ja: 内部名はJASMがキャラクター/Modオブジェクトを識別するために使用されます。Modフォルダーの名前としても使用されます。一意である必要があります。キャラクター作成後に変更すると、JASMはこれを新しいキャラクターとして認識します。
pt_br: O Nome Interno é usado pelo JASM+ para identificar personagens/Objetos de Mod. Também é usado como nome da pasta de mods. Deve ser único. Alterar isso após criar o personagem significa que o JASM+ identificará isso como um novo personagem.
ru_ru: Внутреннее имя используется JASM+ для идентификации персонажей/объектов модов. Оно также используется как имя папки модов. Должно быть уникальным. Изменение этого после создания персонажа означает, что JASM+ будет идентифицировать его как нового персонажа.

# EditCharacterPage_IsMultiModHelp.Text
source: If Checked JASM won't show a warning when multiple mods are enabled for this mod object.
ja: チェックすると、このModオブジェクトで複数のModが有効になっている場合にJASMは警告を表示しなくなります。
pt_br: Se marcado, o JASM+ não mostrará um aviso quando vários mods estiverem habilitados para este objeto de mod.
ru_ru: Если отмечено, JASM+ не будет показывать предупреждение, когда для этого объекта мода включено несколько модов.

# Notification_UnstableState
source: JASM may be in an unstable state could crash at any moment. It is suggested to restart the app.
ja: JASMは不安定な状態にある可能性があり、いつクラッシュしてもおかしくありません。アプリを再起動することをお勧めします。
ru_ru: JASM+ может находиться в нестабильном состоянии и может вылететь в любой момент. Рекомендуется перезапустить приложение.

# Notification_NoMultipleInstalls
source: JASM does not support multiple mod installs for the same character
ja: JASMは同じキャラクターへの複数のModインストールをサポートしていません。
pt_br: O JASM+ não suporta múltiplas instalações de mods para o mesmo personagem
ru_ru: JASM+ не поддерживает множественную установку модов для одного персонажа

# Notification_CouldNotFindModMsg
source: An error occured trying to set Mod ini, restarting JASM may help
ja: Mod iniの設定中にエラーが発生しました。JASMを再起動すると解決する場合があります。
pt_br: Ocorreu um erro ao tentar definir o ini do mod, reiniciar o JASM+ pode ajudar
ru_ru: Произошла ошибка при попытке установить ini мода, перезапуск JASM+ может помочь

# Notification_BgCheckerFatal
source: A fatal error occured in the background checker ({0} : {1}). This means that JASM can no longer check for mod updates in the background or manually. Error: {2}
ja: バックグラウンドチェッカーで致命的なエラーが発生しました（{0} : {1}）。JASMはバックグラウンドでも手動でもModの更新を確認できなくなりました。エラー: {2}
pt_br: Ocorreu um erro fatal no verificador em segundo plano ({0} : {1}). Isso significa que o JASM+ não pode mais verificar atualizações de mods em segundo plano ou manualmente. Erro: {2}
ru_ru: Произошла фатальная ошибка в фоновом модуле проверки ({0} : {1}). Это означает, что JASM+ больше не может проверять обновления модов в фоновом режиме или вручную. Ошибка: {2}

# Notification_CouldNotDetermineSkinMsg
source: JASM could not determine what ingame skin this mod is for, therefore it can't determine what mods to disable.
ja: JASMはこのModがどのゲーム内スキン用かを特定できなかったため、無効にするModを決定できません。
pt_br: O JASM+ não pôde determinar para qual skin do jogo este mod é, portanto não pode determinar quais mods desabilitar.
ru_ru: JASM+ не смог определить, для какого игрового скина предназначен этот мод, поэтому не может определить, какие моды отключать.

# ModPane_SetModIni.ToolTipService.ToolTip
source: Set the mod .ini file to be read by JASM
ja: Modの.iniファイルを設定します
pt_br: Definir o arquivo .ini do mod para ser lido pelo JASM+
ru_ru: Установить .ini файл мода

# ModPane_IgnoreIni.ToolTipService.ToolTip
source: JASM will not look for merged.ini/Script.ini file and ignore keyswaps for this mod
ja: このModの.iniファイルを無視します
pt_br: O JASM+ não procurará o arquivo merged.ini/Script.ini e ignorará key swaps para este mod
ru_ru: Игнорировать .ini файл для этого мода

# CharactersPage_ModsSubMenu.Text
source: Mods
ru_ru: Моды

# CharacterDetails_MenuBar_Mods.Title
source: Mods
ru_ru: Моды

# ModListOverview_ModsMenu.Title
source: Mods
ru_ru: Моды

# AppDescription
source: JASM - Just Another Skin Manager
pt_br: JASM+ - Um Gerenciador de Skins

# Settings_GithubLink.Content
source: Just Another Skin Manager Github
pt_br: JASM+ no Github

# Settings_GameBananaLink.Content
source: Just Another Skin Manager GameBanana
pt_br: JASM+ no GameBanana
